###################################################################

# Created by write_sdc on Sat Feb 15 14:49:13 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
create_clock [get_ports clk_i]  -period 5  -waveform {0 2.5}
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[31]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[30]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[29]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[28]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[27]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[26]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[25]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[24]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[23]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[22]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[21]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[20]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[19]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[18]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[17]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[16]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[15]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[14]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[13]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[12]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[11]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[10]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[9]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[8]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[7]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[6]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[5]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[4]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[3]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[2]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[1]}]
set_input_delay -clock clk_i  2.5  [get_ports {irq_i[0]}]
set_input_delay -clock clk_i  0.5  [get_ports instr_gnt_i]
set_input_delay -clock clk_i  0.5  [get_ports instr_rvalid_i]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[31]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[30]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[29]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[28]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[27]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[26]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[25]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[24]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[23]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[22]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[21]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[20]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[19]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[18]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[17]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[16]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[15]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[14]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[13]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[12]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[11]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[10]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[9]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[8]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[7]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[6]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[5]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[4]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[3]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[2]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[1]}]
set_input_delay -clock clk_i  0.5  [get_ports {instr_rdata_i[0]}]
set_input_delay -clock clk_i  0.5  [get_ports data_gnt_i]
set_input_delay -clock clk_i  0.5  [get_ports data_rvalid_i]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[31]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[30]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[29]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[28]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[27]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[26]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[25]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[24]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[23]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[22]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[21]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[20]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[19]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[18]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[17]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[16]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[15]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[14]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[13]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[12]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[11]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[10]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[9]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[8]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[7]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[6]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[5]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[4]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[3]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[2]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[1]}]
set_input_delay -clock clk_i  0.5  [get_ports {data_rdata_i[0]}]
set_input_delay -clock clk_i  0.5  [get_ports debug_req_i]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[31]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[30]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[29]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[28]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[27]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[26]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[25]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[24]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[23]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[22]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[21]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[20]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[19]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[18]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[17]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[16]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[15]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[14]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[13]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[12]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[11]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[10]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[9]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[8]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[7]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[6]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[5]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[4]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[3]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[2]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[1]}]
set_input_delay -clock clk_i  0.5  [get_ports {boot_addr_i[0]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[31]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[30]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[29]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[28]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[27]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[26]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[25]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[24]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[23]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[22]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[21]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[20]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[19]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[18]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[17]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[16]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[15]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[14]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[13]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[12]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[11]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[10]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[9]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[8]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[7]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[6]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[5]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[4]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[3]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[2]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[1]}]
set_input_delay -clock clk_i  0.5  [get_ports {mtvec_addr_i[0]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[31]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[30]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[29]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[28]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[27]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[26]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[25]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[24]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[23]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[22]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[21]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[20]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[19]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[18]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[17]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[16]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[15]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[14]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[13]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[12]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[11]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[10]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[9]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[8]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[7]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[6]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[5]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[4]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[3]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[2]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[1]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_halt_addr_i[0]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[31]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[30]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[29]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[28]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[27]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[26]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[25]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[24]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[23]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[22]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[21]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[20]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[19]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[18]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[17]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[16]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[15]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[14]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[13]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[12]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[11]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[10]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[9]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[8]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[7]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[6]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[5]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[4]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[3]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[2]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[1]}]
set_input_delay -clock clk_i  0.5  [get_ports {hart_id_i[0]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[31]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[30]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[29]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[28]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[27]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[26]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[25]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[24]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[23]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[22]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[21]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[20]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[19]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[18]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[17]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[16]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[15]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[14]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[13]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[12]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[11]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[10]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[9]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[8]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[7]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[6]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[5]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[4]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[3]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[2]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[1]}]
set_input_delay -clock clk_i  0.5  [get_ports {dm_exception_addr_i[0]}]
set_input_delay -clock clk_i  0.5  [get_ports rst_ni]
set_input_delay -clock clk_i  0.5  [get_ports pulp_clock_en_i]
set_input_delay -clock clk_i  0.5  [get_ports scan_cg_en_i]
set_input_delay -clock clk_i  0.5  [get_ports apu_gnt_i]
set_input_delay -clock clk_i  0.5  [get_ports apu_rvalid_i]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[31]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[30]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[29]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[28]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[27]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[26]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[25]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[24]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[23]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[22]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[21]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[20]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[19]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[18]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[17]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[16]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[15]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[14]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[13]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[12]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[11]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[10]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[9]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[8]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[7]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[6]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[5]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[4]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[3]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[2]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[1]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_result_i[0]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_flags_i[4]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_flags_i[3]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_flags_i[2]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_flags_i[1]}]
set_input_delay -clock clk_i  0.5  [get_ports {apu_flags_i[0]}]
set_input_delay -clock clk_i  0.5  [get_ports fetch_enable_i]
set_output_delay -clock clk_i  3  [get_ports irq_ack_o]
set_output_delay -clock clk_i  3  [get_ports {irq_id_o[4]}]
set_output_delay -clock clk_i  3  [get_ports {irq_id_o[3]}]
set_output_delay -clock clk_i  3  [get_ports {irq_id_o[2]}]
set_output_delay -clock clk_i  3  [get_ports {irq_id_o[1]}]
set_output_delay -clock clk_i  3  [get_ports {irq_id_o[0]}]
set_output_delay -clock clk_i  3  [get_ports instr_req_o]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[31]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[30]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[29]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[28]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[27]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[26]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[25]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[24]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[23]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[22]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[21]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[20]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[19]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[18]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[17]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[16]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[15]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[14]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[13]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[12]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[11]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[10]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[9]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[8]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[7]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[6]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[5]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[4]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[3]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[2]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[1]}]
set_output_delay -clock clk_i  3  [get_ports {instr_addr_o[0]}]
set_output_delay -clock clk_i  3  [get_ports data_req_o]
set_output_delay -clock clk_i  3  [get_ports data_we_o]
set_output_delay -clock clk_i  3  [get_ports {data_be_o[3]}]
set_output_delay -clock clk_i  3  [get_ports {data_be_o[2]}]
set_output_delay -clock clk_i  3  [get_ports {data_be_o[1]}]
set_output_delay -clock clk_i  3  [get_ports {data_be_o[0]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[31]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[30]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[29]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[28]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[27]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[26]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[25]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[24]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[23]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[22]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[21]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[20]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[19]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[18]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[17]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[16]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[15]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[14]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[13]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[12]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[11]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[10]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[9]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[8]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[7]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[6]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[5]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[4]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[3]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[2]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[1]}]
set_output_delay -clock clk_i  3  [get_ports {data_addr_o[0]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[31]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[30]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[29]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[28]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[27]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[26]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[25]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[24]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[23]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[22]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[21]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[20]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[19]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[18]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[17]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[16]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[15]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[14]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[13]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[12]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[11]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[10]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[9]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[8]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[7]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[6]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[5]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[4]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[3]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[2]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[1]}]
set_output_delay -clock clk_i  3  [get_ports {data_wdata_o[0]}]
set_output_delay -clock clk_i  3  [get_ports apu_req_o]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[95]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[94]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[93]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[92]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[91]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[90]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[89]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[88]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[87]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[86]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[85]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[84]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[83]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[82]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[81]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[80]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[79]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[78]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[77]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[76]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[75]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[74]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[73]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[72]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[71]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[70]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[69]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[68]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[67]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[66]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[65]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[64]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[63]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[62]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[61]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[60]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[59]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[58]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[57]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[56]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[55]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[54]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[53]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[52]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[51]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[50]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[49]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[48]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[47]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[46]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[45]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[44]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[43]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[42]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[41]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[40]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[39]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[38]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[37]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[36]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[35]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[34]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[33]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[32]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[31]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[30]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[29]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[28]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[27]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[26]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[25]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[24]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[23]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[22]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[21]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[20]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[19]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[18]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[17]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[16]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[15]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[14]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[13]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[12]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[11]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[10]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[9]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[8]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[7]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[6]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[5]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[4]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[3]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[2]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[1]}]
set_output_delay -clock clk_i  3  [get_ports {apu_operands_o[0]}]
set_output_delay -clock clk_i  3  [get_ports {apu_op_o[5]}]
set_output_delay -clock clk_i  3  [get_ports {apu_op_o[4]}]
set_output_delay -clock clk_i  3  [get_ports {apu_op_o[3]}]
set_output_delay -clock clk_i  3  [get_ports {apu_op_o[2]}]
set_output_delay -clock clk_i  3  [get_ports {apu_op_o[1]}]
set_output_delay -clock clk_i  3  [get_ports {apu_op_o[0]}]
set_output_delay -clock clk_i  3  [get_ports {apu_flags_o[14]}]
set_output_delay -clock clk_i  3  [get_ports {apu_flags_o[13]}]
set_output_delay -clock clk_i  3  [get_ports {apu_flags_o[12]}]
set_output_delay -clock clk_i  3  [get_ports {apu_flags_o[11]}]
set_output_delay -clock clk_i  3  [get_ports {apu_flags_o[10]}]
set_output_delay -clock clk_i  3  [get_ports {apu_flags_o[9]}]
set_output_delay -clock clk_i  3  [get_ports {apu_flags_o[8]}]
set_output_delay -clock clk_i  3  [get_ports {apu_flags_o[7]}]
set_output_delay -clock clk_i  3  [get_ports {apu_flags_o[6]}]
set_output_delay -clock clk_i  3  [get_ports {apu_flags_o[5]}]
set_output_delay -clock clk_i  3  [get_ports {apu_flags_o[4]}]
set_output_delay -clock clk_i  3  [get_ports {apu_flags_o[3]}]
set_output_delay -clock clk_i  3  [get_ports {apu_flags_o[2]}]
set_output_delay -clock clk_i  3  [get_ports {apu_flags_o[1]}]
set_output_delay -clock clk_i  3  [get_ports {apu_flags_o[0]}]
set_output_delay -clock clk_i  3  [get_ports debug_havereset_o]
set_output_delay -clock clk_i  3  [get_ports debug_running_o]
set_output_delay -clock clk_i  3  [get_ports debug_halted_o]
set_output_delay -clock clk_i  1.25  [get_ports core_sleep_o]
set_clock_gating_check -rise -setup 0 [get_cells cs_registers_i/clk_gate_mcountinhibit_q_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells cs_registers_i/clk_gate_mcountinhibit_q_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells cs_registers_i/clk_gate_mcountinhibit_q_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells cs_registers_i/clk_gate_mcountinhibit_q_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells {cs_registers_i/clk_gate_mhpmevent_q_reg[3]_0/main_gate}]
set_clock_gating_check -fall -setup 0 [get_cells {cs_registers_i/clk_gate_mhpmevent_q_reg[3]_0/main_gate}]
set_clock_gating_check -rise -hold 0 [get_cells {cs_registers_i/clk_gate_mhpmevent_q_reg[3]_0/main_gate}]
set_clock_gating_check -fall -hold 0 [get_cells {cs_registers_i/clk_gate_mhpmevent_q_reg[3]_0/main_gate}]
set_clock_gating_check -rise -setup 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[3]_1/main_gate}]
set_clock_gating_check -fall -setup 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[3]_1/main_gate}]
set_clock_gating_check -rise -hold 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[3]_1/main_gate}]
set_clock_gating_check -fall -hold 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[3]_1/main_gate}]
set_clock_gating_check -rise -setup 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[3]_2/main_gate}]
set_clock_gating_check -fall -setup 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[3]_2/main_gate}]
set_clock_gating_check -rise -hold 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[3]_2/main_gate}]
set_clock_gating_check -fall -hold 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[3]_2/main_gate}]
set_clock_gating_check -rise -setup 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[2]_1/main_gate}]
set_clock_gating_check -fall -setup 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[2]_1/main_gate}]
set_clock_gating_check -rise -hold 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[2]_1/main_gate}]
set_clock_gating_check -fall -hold 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[2]_1/main_gate}]
set_clock_gating_check -rise -setup 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[2]_2/main_gate}]
set_clock_gating_check -fall -setup 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[2]_2/main_gate}]
set_clock_gating_check -rise -hold 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[2]_2/main_gate}]
set_clock_gating_check -fall -hold 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[2]_2/main_gate}]
set_clock_gating_check -rise -setup 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[0]_1/main_gate}]
set_clock_gating_check -fall -setup 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[0]_1/main_gate}]
set_clock_gating_check -rise -hold 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[0]_1/main_gate}]
set_clock_gating_check -fall -hold 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[0]_1/main_gate}]
set_clock_gating_check -rise -setup 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[0]_2/main_gate}]
set_clock_gating_check -fall -setup 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[0]_2/main_gate}]
set_clock_gating_check -rise -hold 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[0]_2/main_gate}]
set_clock_gating_check -fall -hold 0 [get_cells {cs_registers_i/clk_gate_mhpmcounter_q_reg[0]_2/main_gate}]
set_clock_gating_check -rise -setup 0 [get_cells cs_registers_i/clk_gate_gen_trigger_regs.tmatch_value_q_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells cs_registers_i/clk_gate_gen_trigger_regs.tmatch_value_q_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells cs_registers_i/clk_gate_gen_trigger_regs.tmatch_value_q_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells cs_registers_i/clk_gate_gen_trigger_regs.tmatch_value_q_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells cs_registers_i/clk_gate_gen_trigger_regs.tmatch_control_exec_q_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells cs_registers_i/clk_gate_gen_trigger_regs.tmatch_control_exec_q_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells cs_registers_i/clk_gate_gen_trigger_regs.tmatch_control_exec_q_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells cs_registers_i/clk_gate_gen_trigger_regs.tmatch_control_exec_q_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells cs_registers_i/clk_gate_mie_q_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells cs_registers_i/clk_gate_mie_q_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells cs_registers_i/clk_gate_mie_q_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells cs_registers_i/clk_gate_mie_q_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells cs_registers_i/clk_gate_mscratch_q_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells cs_registers_i/clk_gate_mscratch_q_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells cs_registers_i/clk_gate_mscratch_q_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells cs_registers_i/clk_gate_mscratch_q_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells cs_registers_i/clk_gate_dscratch1_q_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells cs_registers_i/clk_gate_dscratch1_q_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells cs_registers_i/clk_gate_dscratch1_q_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells cs_registers_i/clk_gate_dscratch1_q_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells cs_registers_i/clk_gate_dscratch0_q_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells cs_registers_i/clk_gate_dscratch0_q_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells cs_registers_i/clk_gate_dscratch0_q_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells cs_registers_i/clk_gate_dscratch0_q_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells {cs_registers_i/clk_gate_dcsr_q_reg[cause]_0/main_gate}]
set_clock_gating_check -fall -setup 0 [get_cells {cs_registers_i/clk_gate_dcsr_q_reg[cause]_0/main_gate}]
set_clock_gating_check -rise -hold 0 [get_cells {cs_registers_i/clk_gate_dcsr_q_reg[cause]_0/main_gate}]
set_clock_gating_check -fall -hold 0 [get_cells {cs_registers_i/clk_gate_dcsr_q_reg[cause]_0/main_gate}]
set_clock_gating_check -rise -setup 0 [get_cells {cs_registers_i/clk_gate_dcsr_q_reg[step]/main_gate}]
set_clock_gating_check -fall -setup 0 [get_cells {cs_registers_i/clk_gate_dcsr_q_reg[step]/main_gate}]
set_clock_gating_check -rise -hold 0 [get_cells {cs_registers_i/clk_gate_dcsr_q_reg[step]/main_gate}]
set_clock_gating_check -fall -hold 0 [get_cells {cs_registers_i/clk_gate_dcsr_q_reg[step]/main_gate}]
set_clock_gating_check -rise -setup 0 [get_cells cs_registers_i/clk_gate_depc_q_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells cs_registers_i/clk_gate_depc_q_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells cs_registers_i/clk_gate_depc_q_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells cs_registers_i/clk_gate_depc_q_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells cs_registers_i/clk_gate_mepc_q_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells cs_registers_i/clk_gate_mepc_q_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells cs_registers_i/clk_gate_mepc_q_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells cs_registers_i/clk_gate_mepc_q_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells load_store_unit_i/clk_gate_rdata_q_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells load_store_unit_i/clk_gate_rdata_q_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells load_store_unit_i/clk_gate_rdata_q_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells load_store_unit_i/clk_gate_rdata_q_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells load_store_unit_i/clk_gate_data_we_q_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells load_store_unit_i/clk_gate_data_we_q_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells load_store_unit_i/clk_gate_data_we_q_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells load_store_unit_i/clk_gate_data_we_q_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells ex_stage_i/clk_gate_regfile_waddr_lsu_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells ex_stage_i/clk_gate_regfile_waddr_lsu_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells ex_stage_i/clk_gate_regfile_waddr_lsu_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells ex_stage_i/clk_gate_regfile_waddr_lsu_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells ex_stage_i/mult_i/clk_gate_mulh_carry_q_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells ex_stage_i/mult_i/clk_gate_mulh_carry_q_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells ex_stage_i/mult_i/clk_gate_mulh_carry_q_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells ex_stage_i/mult_i/clk_gate_mulh_carry_q_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells ex_stage_i/alu_i/alu_div_i/clk_gate_Cnt_DP_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells ex_stage_i/alu_i/alu_div_i/clk_gate_Cnt_DP_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells ex_stage_i/alu_i/alu_div_i/clk_gate_Cnt_DP_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells ex_stage_i/alu_i/alu_div_i/clk_gate_Cnt_DP_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells ex_stage_i/alu_i/alu_div_i/clk_gate_ResReg_DP_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells ex_stage_i/alu_i/alu_div_i/clk_gate_ResReg_DP_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells ex_stage_i/alu_i/alu_div_i/clk_gate_ResReg_DP_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells ex_stage_i/alu_i/alu_div_i/clk_gate_ResReg_DP_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells ex_stage_i/alu_i/alu_div_i/clk_gate_AReg_DP_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells ex_stage_i/alu_i/alu_div_i/clk_gate_AReg_DP_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells ex_stage_i/alu_i/alu_div_i/clk_gate_AReg_DP_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells ex_stage_i/alu_i/alu_div_i/clk_gate_AReg_DP_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells ex_stage_i/alu_i/alu_div_i/clk_gate_CompInv_SP_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells ex_stage_i/alu_i/alu_div_i/clk_gate_CompInv_SP_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells ex_stage_i/alu_i/alu_div_i/clk_gate_CompInv_SP_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells ex_stage_i/alu_i/alu_div_i/clk_gate_CompInv_SP_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells id_stage_i/clk_gate_data_reg_offset_ex_o_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells id_stage_i/clk_gate_data_reg_offset_ex_o_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells id_stage_i/clk_gate_data_reg_offset_ex_o_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells id_stage_i/clk_gate_data_reg_offset_ex_o_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells id_stage_i/clk_gate_regfile_alu_waddr_ex_o_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells id_stage_i/clk_gate_regfile_alu_waddr_ex_o_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells id_stage_i/clk_gate_regfile_alu_waddr_ex_o_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells id_stage_i/clk_gate_regfile_alu_waddr_ex_o_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells id_stage_i/clk_gate_regfile_waddr_ex_o_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells id_stage_i/clk_gate_regfile_waddr_ex_o_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells id_stage_i/clk_gate_regfile_waddr_ex_o_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells id_stage_i/clk_gate_regfile_waddr_ex_o_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells id_stage_i/clk_gate_mult_operand_c_ex_o_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells id_stage_i/clk_gate_mult_operand_c_ex_o_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells id_stage_i/clk_gate_mult_operand_c_ex_o_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells id_stage_i/clk_gate_mult_operand_c_ex_o_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells id_stage_i/clk_gate_mult_operator_ex_o_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells id_stage_i/clk_gate_mult_operator_ex_o_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells id_stage_i/clk_gate_mult_operator_ex_o_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells id_stage_i/clk_gate_mult_operator_ex_o_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells id_stage_i/clk_gate_bmask_a_ex_o_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells id_stage_i/clk_gate_bmask_a_ex_o_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells id_stage_i/clk_gate_bmask_a_ex_o_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells id_stage_i/clk_gate_bmask_a_ex_o_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells id_stage_i/clk_gate_alu_operand_b_ex_o_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells id_stage_i/clk_gate_alu_operand_b_ex_o_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells id_stage_i/clk_gate_alu_operand_b_ex_o_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells id_stage_i/clk_gate_alu_operand_b_ex_o_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells id_stage_i/clk_gate_alu_operand_a_ex_o_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells id_stage_i/clk_gate_alu_operand_a_ex_o_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells id_stage_i/clk_gate_alu_operand_a_ex_o_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells id_stage_i/clk_gate_alu_operand_a_ex_o_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells id_stage_i/clk_gate_alu_operator_ex_o_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells id_stage_i/clk_gate_alu_operator_ex_o_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells id_stage_i/clk_gate_alu_operator_ex_o_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells id_stage_i/clk_gate_alu_operator_ex_o_reg_0/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells id_stage_i/clk_gate_alu_en_ex_o_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells id_stage_i/clk_gate_alu_en_ex_o_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells id_stage_i/clk_gate_alu_en_ex_o_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells id_stage_i/clk_gate_alu_en_ex_o_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells if_stage_i/clk_gate_is_compressed_id_o_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells if_stage_i/clk_gate_is_compressed_id_o_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells if_stage_i/clk_gate_is_compressed_id_o_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells if_stage_i/clk_gate_is_compressed_id_o_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells if_stage_i/aligner_i/clk_gate_hwlp_update_pc_q_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells if_stage_i/aligner_i/clk_gate_hwlp_update_pc_q_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells if_stage_i/aligner_i/clk_gate_hwlp_update_pc_q_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells if_stage_i/aligner_i/clk_gate_hwlp_update_pc_q_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells if_stage_i/prefetch_buffer_i/instruction_obi_i/clk_gate_gen_no_trans_stable.obi_addr_q_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells if_stage_i/prefetch_buffer_i/instruction_obi_i/clk_gate_gen_no_trans_stable.obi_addr_q_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells if_stage_i/prefetch_buffer_i/instruction_obi_i/clk_gate_gen_no_trans_stable.obi_addr_q_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells if_stage_i/prefetch_buffer_i/instruction_obi_i/clk_gate_gen_no_trans_stable.obi_addr_q_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells {if_stage_i/prefetch_buffer_i/fifo_i/clk_gate_mem_q_reg[0]_0/main_gate}]
set_clock_gating_check -fall -setup 0 [get_cells {if_stage_i/prefetch_buffer_i/fifo_i/clk_gate_mem_q_reg[0]_0/main_gate}]
set_clock_gating_check -rise -hold 0 [get_cells {if_stage_i/prefetch_buffer_i/fifo_i/clk_gate_mem_q_reg[0]_0/main_gate}]
set_clock_gating_check -fall -hold 0 [get_cells {if_stage_i/prefetch_buffer_i/fifo_i/clk_gate_mem_q_reg[0]_0/main_gate}]
set_clock_gating_check -rise -setup 0 [get_cells {if_stage_i/prefetch_buffer_i/fifo_i/clk_gate_mem_q_reg[1]_0/main_gate}]
set_clock_gating_check -fall -setup 0 [get_cells {if_stage_i/prefetch_buffer_i/fifo_i/clk_gate_mem_q_reg[1]_0/main_gate}]
set_clock_gating_check -rise -hold 0 [get_cells {if_stage_i/prefetch_buffer_i/fifo_i/clk_gate_mem_q_reg[1]_0/main_gate}]
set_clock_gating_check -fall -hold 0 [get_cells {if_stage_i/prefetch_buffer_i/fifo_i/clk_gate_mem_q_reg[1]_0/main_gate}]
set_clock_gating_check -rise -setup 0 [get_cells if_stage_i/prefetch_buffer_i/prefetch_controller_i/clk_gate_trans_addr_q_reg_0/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells if_stage_i/prefetch_buffer_i/prefetch_controller_i/clk_gate_trans_addr_q_reg_0/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells if_stage_i/prefetch_buffer_i/prefetch_controller_i/clk_gate_trans_addr_q_reg_0/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells if_stage_i/prefetch_buffer_i/prefetch_controller_i/clk_gate_trans_addr_q_reg_0/main_gate]
